internal/cli/testdata/golden/petstore-multi/architecture.dot
// Architecture of petstore-multi, generated by cloudcc.
digraph "petstore-multi" {
    rankdir=LR;
    node [shape=box, style=rounded, fontname="Helvetica"];
    edge [fontname="Helvetica", fontsize=10];
    aws_apigatewayv2_integration_pet_api [label="pet-api\\napigatewayv2.integration", shape=box];
    aws_apigatewayv2_route_pet_api [label="pet-api\\napigatewayv2.route", shape=box];
    aws_apigatewayv2_stage_pet_api [label="pet-api\\napigatewayv2.stage", shape=box];
    aws_apigatewayv2_pet_api [label="pet-api\\napigatewayv2", shape=ellipse];
    aws_cloudfront_oai_petstore_site [label="petstore-site\\ncloudfront.oai", shape=box];
    aws_cloudfront_petstore_site [label="petstore-site\\ncloudfront", shape=parallelogram];
    aws_cloudwatch_loggroup_api [label="api\\ncloudwatch.loggroup", shape=box];
    aws_cloudwatch_loggroup_worker [label="worker\\ncloudwatch.loggroup", shape=box];
    aws_dynamodb_petsByOwner [label="petsByOwner\\ndynamodb", shape=cylinder];
    aws_elasticache_petCache [label="petCache\\nelasticache", shape=cylinder];
    aws_iam_policy_api [label="api\\niam.policy", shape=box];
    aws_iam_policy_worker [label="worker\\niam.policy", shape=box];
    aws_iam_role_api [label="api\\niam.role", shape=box];
    aws_iam_role_worker [label="worker\\niam.role", shape=box];
    aws_lambda_eventsourcemapping_worker_petEvents [label="worker-petEvents\\nlambda.eventsourcemapping", shape=cds];
    aws_lambda_permission_pet_api [label="pet-api\\nlambda.permission", shape=box];
    aws_lambda_api [label="api\\nlambda", shape=box];
    aws_lambda_worker [label="worker\\nlambda", shape=box];
    aws_rds_auditdb [label="auditdb\\nrds", shape=cylinder];
    aws_rds_petsdb [label="petsdb\\nrds", shape=cylinder];
    aws_s3_bucketpolicy_petstore_site [label="petstore-site\\ns3.bucketpolicy", shape=box];
    aws_s3_object_petstore_site_index_html [label="petstore-site/index.html\\ns3.object", shape=parallelogram];
    aws_s3_object_petstore_site_style_css [label="petstore-site/style.css\\ns3.object", shape=parallelogram];
    aws_s3_petAudit [label="petAudit\\ns3", shape=cylinder];
    aws_s3_petstore_site [label="petstore-site\\ns3", shape=cylinder];
    aws_secretsmanager_auditKey [label="auditKey\\nsecretsmanager", shape=cylinder];
    aws_sqs_petEvents [label="petEvents\\nsqs", shape=cds];
    aws_subnetgroup_elasticache [label="elasticache\\nsubnetgroup", shape=box];
    aws_subnetgroup_rds [label="rds\\nsubnetgroup", shape=box];
    aws_vpc_gateway_network [label="network\\nvpc.gateway", shape=box];
    aws_vpc_routeassoc_network_0 [label="network-0\\nvpc.routeassoc", shape=box];
    aws_vpc_routeassoc_network_1 [label="network-1\\nvpc.routeassoc", shape=box];
    aws_vpc_routetable_network [label="network\\nvpc.routetable", shape=box];
    aws_vpc_securitygroup_network [label="network\\nvpc.securitygroup", shape=box];
    aws_vpc_subnet_network_0 [label="network-0\\nvpc.subnet", shape=box];
    aws_vpc_subnet_network_1 [label="network-1\\nvpc.subnet", shape=box];
    aws_vpc_network [label="network\\nvpc", shape=box];
    aws_apigatewayv2_integration_pet_api -> aws_apigatewayv2_pet_api [label="depends_on"];
    aws_apigatewayv2_integration_pet_api -> aws_lambda_api [label="depends_on"];
    aws_apigatewayv2_route_pet_api -> aws_apigatewayv2_integration_pet_api [label="depends_on"];
    aws_apigatewayv2_route_pet_api -> aws_apigatewayv2_pet_api [label="depends_on"];
    aws_apigatewayv2_stage_pet_api -> aws_apigatewayv2_route_pet_api [label="depends_on"];
    aws_apigatewayv2_stage_pet_api -> aws_apigatewayv2_pet_api [label="depends_on"];
    aws_cloudfront_petstore_site -> aws_cloudfront_oai_petstore_site [label="depends_on"];
    aws_cloudfront_petstore_site -> aws_s3_bucketpolicy_petstore_site [label="depends_on"];
    aws_cloudfront_petstore_site -> aws_s3_petstore_site [label="depends_on"];
    aws_elasticache_petCache -> aws_subnetgroup_elasticache [label="depends_on"];
    aws_elasticache_petCache -> aws_vpc_securitygroup_network [label="depends_on"];
    aws_iam_policy_api -> aws_dynamodb_petsByOwner [label="depends_on"];
    aws_iam_policy_api -> aws_iam_role_api [label="depends_on"];
    aws_iam_policy_api -> aws_rds_petsdb [label="depends_on"];
    aws_iam_policy_api -> aws_sqs_petEvents [label="depends_on"];
    aws_iam_policy_worker -> aws_dynamodb_petsByOwner [label="depends_on"];
    aws_iam_policy_worker -> aws_iam_role_worker [label="depends_on"];
    aws_iam_policy_worker -> aws_rds_auditdb [label="depends_on"];
    aws_iam_policy_worker -> aws_s3_petAudit [label="depends_on"];
    aws_iam_policy_worker -> aws_secretsmanager_auditKey [label="depends_on"];
    aws_iam_policy_worker -> aws_sqs_petEvents [label="depends_on"];
    aws_lambda_eventsourcemapping_worker_petEvents -> aws_iam_policy_worker [label="depends_on"];
    aws_lambda_eventsourcemapping_worker_petEvents -> aws_lambda_worker [label="depends_on"];
    aws_lambda_eventsourcemapping_worker_petEvents -> aws_sqs_petEvents [label="depends_on"];
    aws_lambda_permission_pet_api -> aws_apigatewayv2_pet_api [label="depends_on"];
    aws_lambda_permission_pet_api -> aws_lambda_api [label="depends_on"];
    aws_lambda_api -> aws_cloudwatch_loggroup_api [label="depends_on"];
    aws_lambda_api -> aws_iam_role_api [label="depends_on"];
    aws_lambda_worker -> aws_cloudwatch_loggroup_worker [label="depends_on"];
    aws_lambda_worker -> aws_iam_role_worker [label="depends_on"];
    aws_rds_auditdb -> aws_subnetgroup_rds [label="depends_on"];
    aws_rds_auditdb -> aws_vpc_securitygroup_network [label="depends_on"];
    aws_rds_petsdb -> aws_subnetgroup_rds [label="depends_on"];
    aws_rds_petsdb -> aws_vpc_securitygroup_network [label="depends_on"];
    aws_s3_bucketpolicy_petstore_site -> aws_cloudfront_oai_petstore_site [label="depends_on"];
    aws_s3_bucketpolicy_petstore_site -> aws_s3_petstore_site [label="depends_on"];
    aws_s3_object_petstore_site_index_html -> aws_s3_petstore_site [label="depends_on"];
    aws_s3_object_petstore_site_style_css -> aws_s3_petstore_site [label="depends_on"];
    aws_subnetgroup_elasticache -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_subnetgroup_elasticache -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_subnetgroup_rds -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_subnetgroup_rds -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_vpc_gateway_network -> aws_vpc_network [label="depends_on"];
    aws_vpc_routeassoc_network_0 -> aws_vpc_routetable_network [label="depends_on"];
    aws_vpc_routeassoc_network_0 -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_vpc_routeassoc_network_1 -> aws_vpc_routetable_network [label="depends_on"];
    aws_vpc_routeassoc_network_1 -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_vpc_routetable_network -> aws_vpc_gateway_network [label="depends_on"];
    aws_vpc_routetable_network -> aws_vpc_network [label="depends_on"];
    aws_vpc_securitygroup_network -> aws_vpc_network [label="depends_on"];
    aws_vpc_subnet_network_0 -> aws_vpc_network [label="depends_on"];
    aws_vpc_subnet_network_1 -> aws_vpc_network [label="depends_on"];
    aws_lambda_api -> aws_dynamodb_petsByOwner [label="uses"];
    aws_lambda_api -> aws_elasticache_petCache [label="uses"];
    aws_lambda_api -> aws_rds_petsdb [label="uses"];
    aws_lambda_api -> aws_sqs_petEvents [label="uses"];
    aws_lambda_worker -> aws_dynamodb_petsByOwner [label="uses"];
    aws_lambda_worker -> aws_rds_auditdb [label="uses"];
    aws_lambda_worker -> aws_s3_petAudit [label="uses"];
    aws_lambda_worker -> aws_secretsmanager_auditKey [label="uses"];
    aws_lambda_worker -> aws_sqs_petEvents [label="uses"];
}
